# 投标盖章签字关键字
tender_sign_type = [
    r'投 ?标 ?人.*?电子[印公签]章',
    r'投 ?标 ?人.*?签章',
    r'投 ?标 ?人.*?盖单位公?章',
    r'投 ?标 ?人.*?加盖公章',
    r'签字或盖章',
    r'保证人[(（]盖章[）)]',
    r'[（(]公章[)）][:：]',
    r'业务公章、签字[:：]',
]


# 投标盖章签字关键字
bid_sign_type_words = {
    'sign_type_words': {
        # '投标文件所附证书证件均为原件扫描件，并采用单位和个人数字证书': ['投标文件所附证书证件', '证书、证件的复印件', '投标文件所附证书证件均为原件扫描件，并采用单位和个人数字证书'],  # 后续添加检查图片盖章再打开
        '投标函': ['投标函'],
        '投标函附录': ['投标函附录'],
        '投标一览表': ['投标一览表'],
        '承诺书': ['服务承诺', '承诺函', '承诺书', '其他承诺书', '作出承诺'],
        '信誉情况承诺书': ['信誉情况承诺书'],
        '投标人承诺书': ['投标人承诺书'],
        '主要人员简历表': ['主要人员简历表'],
        '投标保证金': ['投标保证金'],
        '无行贿犯罪': ['投标人无行贿犯罪声明', '未有行贿'],
        '问题澄清通知': ['问题澄清通知', '问题的澄清'],
        '授权委托书': ['授权委托书'],
        '近年发生的诉讼及仲裁情况': ['近年发生的诉讼及仲裁情况', '近年发生的诉讼和仲裁情况', '诉讼及仲裁情况'],
        '履约担保': ['履约担保', '担保'],
        '廉洁合同': ['廉洁合同', '廉政条款'],
        '身份证明': ['身份证明', '法定代表人身份证明及授权委托书'],
        '委托维修授权书': ['委托维修授权书'],
        '重大偏差': ['重大偏差'],
        '工程质量保修书': ['工程质量保修书'],
        '详细报价清单': ['详细报价清单'],
        '基本情况表': ['基本情况表'],
        '投标文件的澄清、说明和补正': ['投标文件的澄清、说明和补正'],
        '分项报价表': ['分项报价表'],
        '其它资料': ['其它资料', '其他资料'],  # 详细划分
        '资格审查资料': ['资格审查资料'],
        '联合体协议书': ['联合体?协议书?', '招标接受联合体投标'],
        '设备设施配套情况表': ['设备设施配套情况'],
        '主要人员汇总表': ['主要人员汇总'],
        '正在运营和新承接的项目情况表': ['正在运营和新承接的项目情况表'],
        '近年完成的类似项目情况表': ['近年完成的类似项目情况'],
        '确认通知': ['确认通知'],
        '商务和技术偏差表': ['商务和技术偏差表'],
        '技术响应/偏差表': ['技术响应/偏差表'],
        '供应商概况': ['供应商概况'],
        '法定代表人资格证明文件': ['法定代表人资格证明文件'],
        '供应商资格声明函': ['供应商资格声明函'],
        '供应商对《合同文本》签署意见': ['供应商对《合同文本》签署意见'],
        '业绩情况一览表': ['(供应商)?(近[0-9一二三四五六七八九十]年)?业绩情况一览表', '近年来类似.*?业绩'],
        '财务状况报告': ['财务状况报告'],
        '固定浮动费率报价表': ['固定浮动费率报价表'],
        '人员配置': ['人员配置'],
        '监理人员进场时间安排表': ['监理人员进场时间'],

    }}


# 招标含有签字盖章关键字
bid_sign_words = {
    '签字盖章':
        [
            r'投 ?标 ?人.*?(:?(:?电子[印签盖公]章)|(:?签字))',
            '投 ?标 ?人.*?(:?(:?盖单位公章)|(:?签字))',
            '投 ?标 ?人.*?(:?(:?加盖公?章)|(:?签字))',
            '投 ?标 ?人.*?(:?(:?签章)|(:?签字))',
            '[（(]公章[)）][:：]',
            '牵头人名称[:：].*?(盖单位章)',
            '投标人[：:].*?[(（]盖章[）)]'
        ]
}


# 签字盖章双侧中招标端签字盖章所在的章节
contrast_signature_situation_lists = [
    ['投标文件的编制', ['投标文件的加密', '投标文件的密封和标记']],
    ['投标人须知', ['总则']],
    ['投标文件格式', ['资格审查资料']],
    ['合同条款及格式', ['发包人要求']],
]


# 盖章签字类型(已投标为主)
base_tender_sign_words = ['近年发生的诉讼及仲裁情况', '问题澄清通知', '委托维修授权书', '授权委托书', '重大偏差', '工程质量保修书', '投标文件的澄清、说明和补正', '确认通知',
                          '其它资料', '联合体协议书']


# 盖章签字检查
stamped_signature_words = ['被授权人', '法定代表人', '法定代表人签字', '委托代理人', '委托代理人签字', '投标人名称']
